---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustAddKingWarn
source: html/7ffb4598-46e0-13e8-a773-3833c9fad527.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustAddKingWarn Property

In order to add this '[Serf]' to the Option Set, you must also add its '[King]'--if you continue it will not be added to the Option Set

## Syntax (C#)
```csharp
public static FailureDefinitionId MustAddKingWarn { get; }
```